# Напишите программу, которая использует функцию abs() и выводит на экран модуль суммы двух переменных num1 и num2.

num1 = 10
num2 = -13

# BEGIN (write your solution here)
abs_with_sum = abs(num1 + num2)
print(str(abs_with_sum))
# END
